# Day 1

## Get amount of female survivors

In [2]:
#read csv files without using pandas
import csv

with open('titanic.csv') as csv_file: #read csv file which automatically closes the file after
    csv_reader = csv.reader(csv_file, delimiter=',')
    # set the counter
    c = 0
    # iterate over rows 
    for row in csv_reader:
        # if passenger is female and if she survived, increase the counter
        if (row[1] == '1') & (row[4] == 'female'): #survived = 1 means true
            c += 1
print(c)

233

In [3]:
#read csv files using pandas
import pandas as pd

df = pd.read_csv('titanic.csv') #read csv file

len(df[(df['Sex'] == 'female') & (df['Survived'] == 1)]) #survived = 1 means true; this line means get the length of the array of sex == female and survived == 1
#df.describe() #gives you the count, mean, std, min, max
#df.dtypes #gives data types of each rows

233

In [4]:
# Another way to count number of survived female passenger in Titanic without using pandas
with open('titanic.csv') as csv_file:
    csv_reader = csv.reader(csv_file, delimiter=',')
    gender_ls = []
    survive_ls = []
    for row in csv_reader:
        gender_ls.append(row[4])
        survive_ls.append(row[1])
        
gender_ls = gender_ls[1:]  
survive_ls = survive_ls[1:]

female_index = [i for i, j in enumerate(gender_ls) if j == 'female']
# print(female_index)
female_survived_not_survived = [survive_ls[i] for i in female_index]

num_female_survived = len([i for i, j in enumerate(female_survived_not_survived) if j == '1'])
print(num_female_survived)

233

# Day 2: Simple Data Manipulation

In [5]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})
df.columns #get column names #prints: Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [6]:
df[['name', 'age', 'state']] #to get first three column

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [7]:
df.loc[2:4, 'name'] #df location, from 2-4 (inclusive) from name only

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [8]:
df.loc[2:4, ['name', 'age']] #get the 2nd-4th rows for name and age

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [9]:
df.iloc[:2] #get the first 2 rows; df.loc would include 2nd which is peter

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [10]:
df.loc[:2] #get up to 2nd row

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [11]:
df.iloc[-2:] #get the last 2 rows

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [12]:
df.iloc[:,0] # get first column with index

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [13]:
# df.loc[:,['age', 'state']] # select columns by name
df[['age', 'state']] #does the same as line above

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [14]:
df.iloc[1] #get second row of data-frame

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

## Filter
#### Conditional data frame selection

In [15]:
df[df['age'] > 30] #get people whose "age" is greater than 30
# df[df.age > 30] #does the same as line above

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [16]:
#df[df.num_pets > df.num_children] #does the same thing as line below
df[df["num_pets"] > df["num_children"]] # get people with more pets than children

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [17]:
# people older than 40 and owns pets
df[(df['age'] > 40) & (df['num_pets'] > 0)] #pandas requires this boolean &

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [18]:
# people older than 40 OR owns pets
df[(df['age'] > 40) | (df['num_pets'] > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

## Drop

In [19]:
# modifies data frame and dropping age and num_children columns
# df = df.drop(["age", "num_children"], axis=1) #axis=1 refers to columns
# copies data frame but in here dropping age and num_children columns
df_new = df.drop(["age", "num_children"], axis=1)
df_new

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [20]:
df # is untouched unless we run the line below

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [21]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

## Applying Functions

In [22]:
# Apply an aggregate function to every column
import numpy as np
df[["age","num_pets","num_children"]].mean()
# df[["age","num_pets","num_children"]].apply(lambda col: np.mean(col),axis=0) #does the same thing

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [23]:
df[["age","num_pets","num_children"]].apply(lambda col: np.sum(col),axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [24]:
df['age'].sum() #sum all age

220

In [25]:
df[["age","num_pets","num_children"]].apply(lambda row: np.sum(row),axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

In [26]:
#Add numerical values of age, num_pets, num_children
df[["age","num_pets","num_children"]].apply(lambda row: np.sum(row),axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

In [27]:
# Select data-frame based on column name //58m
df[['age']] #data frame //uses: filtering use this
# pd.DataFrame(df.age) # same as line above
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [28]:
df['age'] #list or series //uses: if we want the value
# df.age #same as line above

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [29]:
#Apply a function to specific column WITHOUT applying the changes to original dataframe //1h7
#Note: This does not affect the original dataframe object. This returns a mutated copy of the specified column
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [30]:
# Apply a function to specific column and apply the changes to original data-frame //1h7
df['age'] = df['age'].apply(lambda x: x*2)
df['age']

0     46
1    156
2     44
3     38
4     90
5     66
Name: age, dtype: int64

## Sort

In [31]:
# Sort DataFrame on a specific column value in ascending order
df.sort_values("age", ascending= True)

    name  age       state  num_children  num_pets
3   jeff   38       texas             1         5
2  peter   44  california             0         0
0   john   46        iowa             2         0
5   lisa   66          dc             1         0
4   bill   90  washington             2         0
1   mary  156          dc             2         4

## Select

In [32]:
# select rows whose name begins with the letter 'j'
df[df.apply(lambda row: row['name'].startswith('j'),axis=1)]

   name  age  state  num_children  num_pets
0  john   46   iowa             2         0
3  jeff   38  texas             1         5

## Pivot Table From Data-Frame

In [33]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [34]:
p = d.pivot(index='Item', columns='CType', values='USD')
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$

# Day 3: Data Manipulation & Visualization

In [35]:
df.head()

    name  age       state  num_children  num_pets
0   john   46        iowa             2         0
1   mary  156          dc             2         4
2  peter   44  california             0         0
3   jeff   38       texas             1         5
4   bill   90  washington             2         0